emacs-packages/emacs-packages-links.org
#+OPTIONS: toc:2 
* EMACS PACKAGES
** ORG-MOD 
------
*** org
*** toc-org
*** org-cliplink
*** org-autolist
*** org-board
*** org-ac
** EVIL
-----
*** evil-opener
*** evil-mark-replace
*** evil-visualstar
*** evil-textobj-anyblock
*** evil-tutor
*** evil-args
*** evil-magit
** HELM
*** helm
*** helm-github-stars
** ACE
*** aceJump  https://www.emacswiki.org/emacs/AceJump
/AceJump-mode is a minor mode for Emacs, enabling fast/direct cursor movement in current view./
*** ace-jump-mode
*** ace-window
** DIRED
*** dired-toggle-sudo
*** dired-quick-sort
** MARKDOWN
*** markdown-mode
** LATEX
*** auctex
** PANDOC
*** pandoc
*** pandoc-mode
** CVS
*** csv-mode
** GIT
*** gited
*** magit
*** gist
** HUGO
*** easy-hugo https://github.com/masasam/emacs-easy-hugo
/Emacs major mode for writing blogs made with hugo by markdown or org-mode or AsciiDoc or reStructuredText or mmark/ 
-
** TWITTER
*** twittering-mode
** SNIPPET
*** yasnippet
** THEMEN
*** solarized-theme
*** airline-themes
-----
** TO SORT
*** syndicate
*** scss-mode
*** undo-tree
*** neotree
*** diffview
