emacs-packages/emacs-packages-links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-09 Son 15:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Patrick Schanen" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcc6900e">1. EMACS PACKAGES</a>
<ul>
<li><a href="#org6431dfd">1.1. ORG-MOD</a></li>
<li><a href="#org06730c1">1.2. EVIL</a></li>
<li><a href="#orgbecdeda">1.3. HELM</a></li>
<li><a href="#org362ccab">1.4. ACE</a></li>
<li><a href="#org5c0ff1a">1.5. DIRED</a></li>
<li><a href="#orge78f991">1.6. MARKDOWN</a></li>
<li><a href="#orge0648a4">1.7. LATEX</a></li>
<li><a href="#orgde673f3">1.8. PANDOC</a></li>
<li><a href="#orgffa0bf0">1.9. CVS</a></li>
<li><a href="#orgb84b5ce">1.10. GIT</a></li>
<li><a href="#orgb1e3f21">1.11. HUGO</a></li>
<li><a href="#org6d4cdfb">1.12. TWITTER</a></li>
<li><a href="#orgebad09a">1.13. SNIPPET</a></li>
<li><a href="#org15d8fb8">1.14. THEMEN</a></li>
<li><a href="#org2ff9511">1.15. TO SORT</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc6900e" class="outline-2">
<h2 id="orgcc6900e"><span class="section-number-2">1</span> EMACS PACKAGES</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org6431dfd" class="outline-3">
<h3 id="org6431dfd"><span class="section-number-3">1.1</span> ORG-MOD</h3>
<div class="outline-text-3" id="text-1-1">
<hr />
</div>
<div id="outline-container-org29e5a74" class="outline-4">
<h4 id="org29e5a74"><span class="section-number-4">1.1.1</span> org</h4>
</div>
<div id="outline-container-org203096b" class="outline-4">
<h4 id="org203096b"><span class="section-number-4">1.1.2</span> toc-org</h4>
</div>
<div id="outline-container-org1d56069" class="outline-4">
<h4 id="org1d56069"><span class="section-number-4">1.1.3</span> org-cliplink</h4>
</div>
<div id="outline-container-org53e195e" class="outline-4">
<h4 id="org53e195e"><span class="section-number-4">1.1.4</span> org-autolist</h4>
</div>
<div id="outline-container-org37ebe69" class="outline-4">
<h4 id="org37ebe69"><span class="section-number-4">1.1.5</span> org-board</h4>
</div>
<div id="outline-container-orgacb6791" class="outline-4">
<h4 id="orgacb6791"><span class="section-number-4">1.1.6</span> org-ac</h4>
</div>
</div>
<div id="outline-container-org06730c1" class="outline-3">
<h3 id="org06730c1"><span class="section-number-3">1.2</span> EVIL</h3>
<div class="outline-text-3" id="text-1-2">
<hr />
</div>
<div id="outline-container-orgb9906e2" class="outline-4">
<h4 id="orgb9906e2"><span class="section-number-4">1.2.1</span> evil-opener</h4>
</div>
<div id="outline-container-org775e6be" class="outline-4">
<h4 id="org775e6be"><span class="section-number-4">1.2.2</span> evil-mark-replace</h4>
</div>
<div id="outline-container-org7d09bc9" class="outline-4">
<h4 id="org7d09bc9"><span class="section-number-4">1.2.3</span> evil-visualstar</h4>
</div>
<div id="outline-container-org09f2af0" class="outline-4">
<h4 id="org09f2af0"><span class="section-number-4">1.2.4</span> evil-textobj-anyblock</h4>
</div>
<div id="outline-container-org0180c60" class="outline-4">
<h4 id="org0180c60"><span class="section-number-4">1.2.5</span> evil-tutor</h4>
</div>
<div id="outline-container-org78dcbb3" class="outline-4">
<h4 id="org78dcbb3"><span class="section-number-4">1.2.6</span> evil-args</h4>
</div>
<div id="outline-container-orgcfc1393" class="outline-4">
<h4 id="orgcfc1393"><span class="section-number-4">1.2.7</span> evil-magit</h4>
</div>
</div>
<div id="outline-container-orgbecdeda" class="outline-3">
<h3 id="orgbecdeda"><span class="section-number-3">1.3</span> HELM</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-org157ac4b" class="outline-4">
<h4 id="org157ac4b"><span class="section-number-4">1.3.1</span> helm</h4>
</div>
<div id="outline-container-orgcb82005" class="outline-4">
<h4 id="orgcb82005"><span class="section-number-4">1.3.2</span> helm-github-stars</h4>
</div>
</div>
<div id="outline-container-org362ccab" class="outline-3">
<h3 id="org362ccab"><span class="section-number-3">1.4</span> ACE</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-org4b83546" class="outline-4">
<h4 id="org4b83546"><span class="section-number-4">1.4.1</span> aceJump  <a href="https://www.emacswiki.org/emacs/AceJump">https://www.emacswiki.org/emacs/AceJump</a></h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<i>AceJump-mode is a minor mode for Emacs, enabling fast/direct cursor movement in current view.</i>
</p>
</div>
</div>
<div id="outline-container-org2998552" class="outline-4">
<h4 id="org2998552"><span class="section-number-4">1.4.2</span> ace-jump-mode</h4>
</div>
<div id="outline-container-org55bf7af" class="outline-4">
<h4 id="org55bf7af"><span class="section-number-4">1.4.3</span> ace-window</h4>
</div>
</div>
<div id="outline-container-org5c0ff1a" class="outline-3">
<h3 id="org5c0ff1a"><span class="section-number-3">1.5</span> DIRED</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgc25f7c8" class="outline-4">
<h4 id="orgc25f7c8"><span class="section-number-4">1.5.1</span> dired-toggle-sudo</h4>
</div>
<div id="outline-container-org777b507" class="outline-4">
<h4 id="org777b507"><span class="section-number-4">1.5.2</span> dired-quick-sort</h4>
</div>
</div>
<div id="outline-container-orge78f991" class="outline-3">
<h3 id="orge78f991"><span class="section-number-3">1.6</span> MARKDOWN</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-orge14398d" class="outline-4">
<h4 id="orge14398d"><span class="section-number-4">1.6.1</span> markdown-mode</h4>
</div>
</div>
<div id="outline-container-orge0648a4" class="outline-3">
<h3 id="orge0648a4"><span class="section-number-3">1.7</span> LATEX</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-orgbb4f7ce" class="outline-4">
<h4 id="orgbb4f7ce"><span class="section-number-4">1.7.1</span> auctex</h4>
</div>
</div>
<div id="outline-container-orgde673f3" class="outline-3">
<h3 id="orgde673f3"><span class="section-number-3">1.8</span> PANDOC</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-org63ccb37" class="outline-4">
<h4 id="org63ccb37"><span class="section-number-4">1.8.1</span> pandoc</h4>
</div>
<div id="outline-container-org3a9a906" class="outline-4">
<h4 id="org3a9a906"><span class="section-number-4">1.8.2</span> pandoc-mode</h4>
</div>
</div>
<div id="outline-container-orgffa0bf0" class="outline-3">
<h3 id="orgffa0bf0"><span class="section-number-3">1.9</span> CVS</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-org7ea1da2" class="outline-4">
<h4 id="org7ea1da2"><span class="section-number-4">1.9.1</span> csv-mode</h4>
</div>
</div>
<div id="outline-container-orgb84b5ce" class="outline-3">
<h3 id="orgb84b5ce"><span class="section-number-3">1.10</span> GIT</h3>
<div class="outline-text-3" id="text-1-10">
</div><div id="outline-container-orgcbb1c4e" class="outline-4">
<h4 id="orgcbb1c4e"><span class="section-number-4">1.10.1</span> gited</h4>
</div>
<div id="outline-container-org82531c2" class="outline-4">
<h4 id="org82531c2"><span class="section-number-4">1.10.2</span> magit</h4>
</div>
<div id="outline-container-org074312f" class="outline-4">
<h4 id="org074312f"><span class="section-number-4">1.10.3</span> gist</h4>
</div>
</div>
<div id="outline-container-orgb1e3f21" class="outline-3">
<h3 id="orgb1e3f21"><span class="section-number-3">1.11</span> HUGO</h3>
<div class="outline-text-3" id="text-1-11">
</div><div id="outline-container-org5b3c7b7" class="outline-4">
<h4 id="org5b3c7b7"><span class="section-number-4">1.11.1</span> easy-hugo <a href="https://github.com/masasam/emacs-easy-hugo">https://github.com/masasam/emacs-easy-hugo</a></h4>
<div class="outline-text-4" id="text-1-11-1">
<p>
<i>Emacs major mode for writing blogs made with hugo by markdown or org-mode or AsciiDoc or reStructuredText or mmark</i> 
</p>
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6d4cdfb" class="outline-3">
<h3 id="org6d4cdfb"><span class="section-number-3">1.12</span> TWITTER</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-org56cfc08" class="outline-4">
<h4 id="org56cfc08"><span class="section-number-4">1.12.1</span> twittering-mode</h4>
</div>
</div>
<div id="outline-container-orgebad09a" class="outline-3">
<h3 id="orgebad09a"><span class="section-number-3">1.13</span> SNIPPET</h3>
<div class="outline-text-3" id="text-1-13">
</div><div id="outline-container-org5ea4afa" class="outline-4">
<h4 id="org5ea4afa"><span class="section-number-4">1.13.1</span> yasnippet</h4>
</div>
</div>
<div id="outline-container-org15d8fb8" class="outline-3">
<h3 id="org15d8fb8"><span class="section-number-3">1.14</span> THEMEN</h3>
<div class="outline-text-3" id="text-1-14">
</div><div id="outline-container-org24125a6" class="outline-4">
<h4 id="org24125a6"><span class="section-number-4">1.14.1</span> solarized-theme</h4>
</div>
<div id="outline-container-orga8d2b45" class="outline-4">
<h4 id="orga8d2b45"><span class="section-number-4">1.14.2</span> airline-themes</h4>
<div class="outline-text-4" id="text-1-14-2">
<hr />
</div>
</div>
</div>
<div id="outline-container-org2ff9511" class="outline-3">
<h3 id="org2ff9511"><span class="section-number-3">1.15</span> TO SORT</h3>
<div class="outline-text-3" id="text-1-15">
</div><div id="outline-container-org3d48cfd" class="outline-4">
<h4 id="org3d48cfd"><span class="section-number-4">1.15.1</span> syndicate</h4>
</div>
<div id="outline-container-org4ed0c53" class="outline-4">
<h4 id="org4ed0c53"><span class="section-number-4">1.15.2</span> scss-mode</h4>
</div>
<div id="outline-container-org1027612" class="outline-4">
<h4 id="org1027612"><span class="section-number-4">1.15.3</span> undo-tree</h4>
</div>
<div id="outline-container-org1016514" class="outline-4">
<h4 id="org1016514"><span class="section-number-4">1.15.4</span> neotree</h4>
</div>
<div id="outline-container-org0c052e1" class="outline-4">
<h4 id="org0c052e1"><span class="section-number-4">1.15.5</span> diffview</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patrick Schanen</p>
<p class="date">Created: 2017-07-09 Son 15:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
